url_shortener/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "CycfNsdO_7a2ZayMsdLYUw"], ["LIMIT", 1]]
---
    def self.random_code
        random_str = SecureRandom.urlsafe_base64

        until !ShortenedUrl.exists?(:short_url => random_str)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "https:appacademy.course.open.fix.learn.code/sweinperson/nextmodule"], ["short_url", "CycfNsdO_7a2ZayMsdLYUw"], ["user_id", 4]]
---
    def self.generate(user, long_url)
        short_url = ShortenedUrl.random_code
        ShortenedUrl.create!(:user_id => user.id, :long_url => long_url, :short_url => short_url)